{
  "name": "Koray E.",
  "location": "Berlin, Germany",
  "experience": [
    {
      "company": "MEMBER",
      "role": "Chief Product Officer (Technical)",
      "dateStart": "2021-10-01",
      "dateEnd": null,
      "about": "MEMBER is a community platform that facilitates anonymous media exchange and chat. In the ongoing soft launch phase, development efforts are concentrated on the integration of third-party tools, such as LLM agents and blockchain marketplaces, to augment knowledge and value exchange within these communities.",
      "responsibilities": [
        "Led the formation and management of cross-functional product and engineering teams, overseeing 17 members, to successfully transform a conceptual idea into a production-ready React Native social media application.",
        "Worked as line cook at a local french restaurant.",
        "Maintained a pristine quality garden for Queen Elizabeth and led her botanic exhibits with success.",
        "Ensured customer groceries are delivered in an effective manner by coordinating rider team.",
        "Created a comprehensive product roadmap, breaking opportunities and issues into executables, and prioritizing backlog for integration during biweekly agile sprints.",
        "Designed and developed a React cross-platform atomic design system utilizing Framer, Storybook, and Tamagui. Provided ongoing support to engineering team, ensuring seamless implementation of the system.",
        "Made substantial contributions to engineering efforts through code reviews and the development of advanced core capabilities. Notable achievements include implementing a continuous integration and deployment pipeline, enabling video playback in nested virtualized lists, handling media transcoding and streaming, and establishing dynamic link payload processing and routing.",
        "Coordinated the discovery and development of in-app economy and monetization, actively contributing to the creation of a blockchain-based prototype in collaboration with an external development studio."
      ]
    },
    {
      "company": "brandTURBO",
      "role": "Head of Product (Technical)",
      "dateStart": "2021-10-01",
      "dateEnd": "2020-05-01",
      "about": "brandTURBO develops and manages numerous React-based Chrome homepage extensions for renowned brands, including Galatasaray, AC Milan, Red Bull, Manchester City, Aston Villa, and Universal Music.",
      "responsibilities": [
        "Supervised the development, repository maintenance, and management of over a hundred React-based Chrome homepage extensions for prestigious brands, including Fenerbahçe, Galatasaray, AC Milan, Red Bull, Manchester City, Aston Villa, and Universal Music.",
        "Owned the strategic planning and execution of product launches and marketing initiatives, acquiring 270,000 new users with 70% click-to-install rate, generating 160 million additional impressions and increasing unique daily active user count to 70,000 across all extensions.",
        "Built third-party integrations for client websites, capturing their web traffic and redirecting it to extension storefronts, resulting in 120,000 clicks and the acquisition of additional 55,000 users.",
        "Designed and developed a mobile waitlist using React, capturing mobile traffic that couldn’t be converted into desktop extension users. As a result, generated over 44,000 sign-ups for upcoming mobile version."
      ]
    }
  ],
  "education": [
    {
      "institution": "Università di Bologna",
      "degree": "Business and Economics",
      "dateStart": " 2014-09-01",
      "dateEnd": "2016-09-01",
      "about": null
    }
  ],
  "preferences": [
    {
      "location": "Berlin, Germany",
      "contract": "Full-time",
      "remote": "Remote",
      "salaryLow": "90000",
      "salaryHigh": "135000",
      "salaryCurrency": "EUR"
    }
  ]
}