{
    "job_company_name": "kevin.",
    "job_role": "Senior Product Manager",
    "job_location": "London, England, United Kingdom",
    "job_contract_type": "Full time",
    "job_remote_work_status": "No remote work available",
    "job_salary_min": 0,
    "job_salary_max": 0,
    "job_description": "kevin. is a payments platform that enables businesses to accept payments directly from their customers' bank accounts, bypassing the need for traditional card networks. The company offers a range of products and services including payment initiation, account-to-account payments, and open banking APIs.",
    "job_requirements": [
        "At least 7 years of experience in modern product management environments as a product manager - also being responsible for creating products from scratch.",
        "You have consistently demonstrated a mindset to combine “flying high” with “digging deep” in complex environments. You were able to create compelling and actionable product visions and strategies in the past and inspiring your teams and stakeholders with them is a passion of yours.",
        "You consistently apply discovery techniques and link them to tangible outcomes. You understand the needs of your customers, users and how these match your product’s capabilities inside out.",
        "You are analytical and enthusiastic about precise problem definitions. Your verbal and written communication skills enable you to provide structure to the team or your stakeholder also in complex and technical domains. That requires you to break down complex problem domains.",
        "You enjoy working on UX driven products and identify the right user experience together with design and research.",
        "You know methods and frameworks to find the most valuable opportunities, slicing solutions to maximize return on investment and you can install them in a product organization."
    ],
    "job_responsibility": [
        "Preparing the vision and strategy, identifying value driver segments, removing unnecessary complexity and translating them into initiatives for our Payment Initiation Instrument team",
        "You will create transparency for all stakeholders involved by using concise, structured written narratives backed up with data to enable smooth decision making.",
        "You will work closely with commercial functions such as Sales, Know Your Customer (KYC), Anti-Money Laundering (AML) etc. Shaping InStore Payment Initiation Instrument (kevin.Pay SDK) product vision and strategy.",
        "Ensuring a fast, efficient, secure payment experience for consumers. This includes but is not limited to our iOS and Android SDKs. Collaborating closely with product, engineering, design, commercial, and marketing teams to deliver exceptional products and experiences that delight our customers.",
        "Establishing clear and scalable frameworks to ensure the right investment decisions for kevin. as well as creating transparency for all stakeholders involved.",
        "Devising new ideas and solutions that are both technically feasible and financially viable within realistic timeframes. Understand emerging technologies, regulatory constraints, and payment trends that may impact product roadmaps."
    ]
}